balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA106.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1CMDH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1CMDH" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GCMD16" edc:desc="" edc:mask="0x1" edc:name="GCMD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD17" edc:desc="" edc:mask="0x1" edc:name="GCMD17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD18" edc:desc="" edc:mask="0x1" edc:name="GCMD18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD19" edc:desc="" edc:mask="0x1" edc:name="GCMD19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD20" edc:desc="" edc:mask="0x1" edc:name="GCMD20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD21" edc:desc="" edc:mask="0x1" edc:name="GCMD21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD22" edc:desc="" edc:mask="0x1" edc:name="GCMD22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD23" edc:desc="" edc:mask="0x1" edc:name="GCMD23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD24" edc:desc="" edc:mask="0x1" edc:name="GCMD24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD25" edc:desc="" edc:mask="0x1" edc:name="GCMD25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD26" edc:desc="" edc:mask="0x1" edc:name="GCMD26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD27" edc:desc="" edc:mask="0x1" edc:name="GCMD27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD28" edc:desc="" edc:mask="0x1" edc:name="GCMD28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD29" edc:desc="" edc:mask="0x1" edc:name="GCMD29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD30" edc:desc="" edc:mask="0x1" edc:name="GCMD30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMD31" edc:desc="" edc:mask="0x1" edc:name="GCMD31" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="G1CON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="G1CON1" edc:nzwidth="16" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GCMDCNT" edc:desc="" edc:mask="0x1f" edc:name="GCMDCNT" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="PUBPP" edc:desc="" edc:mask="0x7" edc:name="PUBPP" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK" edc:desc="" edc:mask="0x1f" edc:name="GCMDWMK" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="G1SIDL" edc:desc="" edc:mask="0x1" edc:name="G1SIDL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GCMDCNT0" edc:desc="" edc:mask="0x1" edc:name="GCMDCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDCNT1" edc:desc="" edc:mask="0x1" edc:name="GCMDCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDCNT2" edc:desc="" edc:mask="0x1" edc:name="GCMDCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDCNT3" edc:desc="" edc:mask="0x1" edc:name="GCMDCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDCNT4" edc:desc="" edc:mask="0x1" edc:name="GCMDCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUBPP0" edc:desc="" edc:mask="0x1" edc:name="PUBPP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUBPP1" edc:desc="" edc:mask="0x1" edc:name="PUBPP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUBPP2" edc:desc="" edc:mask="0x1" edc:name="PUBPP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK0" edc:desc="" edc:mask="0x1" edc:name="GCMDWMK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK1" edc:desc="" edc:mask="0x1" edc:name="GCMDWMK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK2" edc:desc="" edc:mask="0x1" edc:name="GCMDWMK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK3" edc:desc="" edc:mask="0x1" edc:name="GCMDWMK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCMDWMK4" edc:desc="" edc:mask="0x1" edc:name="GCMDWMK4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:FreezeBit edc:freezeval="1" edc:name="GRAPHICS" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-------nnnnnnnn" edc:cname="G1STAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------00000000" edc:name="G1STAT" edc:nzwidth="16" edc:por="0-------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMDMPT" edc:desc="" edc:mask="0x1" edc:name="CMDMPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDFUL" edc:desc="" edc:mask="0x1" edc:name="CMDFUL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDLV" edc:desc="" edc:mask="0x1" edc:name="CMDLV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HMRGN" edc:desc="" edc:mask="0x1" edc:name="HMRGN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VMRGN" edc:desc="" edc:mask="0x1" edc:name="VMRGN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHRBUSY" edc:desc="" edc:mask="0x1" edc:name="CHRBUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCCBUSY" edc:desc="" edc:mask="0x1" edc:name="RCCBUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPUBUSY" edc:desc="" edc:mask="0x1" edc:name="IPUBUSY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PUBUSY" edc:desc="" edc:mask="0x1" edc:name="PUBUSY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-------nnnnnnnn" edc:cname="G1IE" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------00000000" edc:name="G1IE" edc:nzwidth="16" edc:por="0-------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMDMPTIE" edc:desc="" edc:mask="0x1" edc:name="CMDMPTIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDFULIE" edc:desc="" edc:mask="0x1" edc:name="CMDFULIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDLVIE" edc:desc="" edc:mask="0x1" edc:name="CMDLVIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HMRGNIE" edc:desc="" edc:mask="0x1" edc:name="HMRGNIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VMRGNIE" edc:desc="" edc:mask="0x1" edc:name="VMRGNIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHRIE" edc:desc="" edc:mask="0x1" edc:name="CHRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCCIE" edc:desc="" edc:mask="0x1" edc:name="RCCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPUIE" edc:desc="" edc:mask="0x1" edc:name="IPUIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="PUIE" edc:desc="" edc:mask="0x1" edc:name="PUIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-------nnnnnnnn" edc:cname="G1IR" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------00000000" edc:name="G1IR" edc:nzwidth="16" edc:por="0-------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMDMPTIF" edc:desc="" edc:mask="0x1" edc:name="CMDMPTIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDFULIF" edc:desc="" edc:mask="0x1" edc:name="CMDFULIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMDLVIF" edc:desc="" edc:mask="0x1" edc:name="CMDLVIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HMRGNIF" edc:desc="" edc:mask="0x1" edc:name="HMRGNIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VMRGNIF" edc:desc="" edc:mask="0x1" edc:name="VMRGNIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHRIF" edc:desc="" edc:mask="0x1" edc:name="CHRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCCIF" edc:desc="" edc:mask="0x1" edc:name="RCCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPUIF" edc:desc="" edc:mask="0x1" edc:name="IPUIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="PUIF" edc:desc="" edc:mask="0x1" edc:name="PUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
