balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA106.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1DPADRL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1DPADRL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPADR0" edc:desc="" edc:mask="0x1" edc:name="DPADR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR1" edc:desc="" edc:mask="0x1" edc:name="DPADR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR2" edc:desc="" edc:mask="0x1" edc:name="DPADR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR3" edc:desc="" edc:mask="0x1" edc:name="DPADR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR4" edc:desc="" edc:mask="0x1" edc:name="DPADR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR5" edc:desc="" edc:mask="0x1" edc:name="DPADR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR6" edc:desc="" edc:mask="0x1" edc:name="DPADR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR7" edc:desc="" edc:mask="0x1" edc:name="DPADR7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR8" edc:desc="" edc:mask="0x1" edc:name="DPADR8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR9" edc:desc="" edc:mask="0x1" edc:name="DPADR9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR10" edc:desc="" edc:mask="0x1" edc:name="DPADR10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR11" edc:desc="" edc:mask="0x1" edc:name="DPADR11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR12" edc:desc="" edc:mask="0x1" edc:name="DPADR12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR13" edc:desc="" edc:mask="0x1" edc:name="DPADR13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR14" edc:desc="" edc:mask="0x1" edc:name="DPADR14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR15" edc:desc="" edc:mask="0x1" edc:name="DPADR15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="G1DPADRH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="G1DPADRH" edc:nzwidth="16" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPADR16" edc:desc="" edc:mask="0x1" edc:name="DPADR16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR17" edc:desc="" edc:mask="0x1" edc:name="DPADR17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR18" edc:desc="" edc:mask="0x1" edc:name="DPADR18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR19" edc:desc="" edc:mask="0x1" edc:name="DPADR19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR20" edc:desc="" edc:mask="0x1" edc:name="DPADR20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR21" edc:desc="" edc:mask="0x1" edc:name="DPADR21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR22" edc:desc="" edc:mask="0x1" edc:name="DPADR22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPADR23" edc:desc="" edc:mask="0x1" edc:name="DPADR23" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1DPW" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1DPW" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPW" edc:desc="" edc:mask="0x7ff" edc:name="DPW" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DPW0" edc:desc="" edc:mask="0x1" edc:name="DPW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW1" edc:desc="" edc:mask="0x1" edc:name="DPW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW2" edc:desc="" edc:mask="0x1" edc:name="DPW2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW3" edc:desc="" edc:mask="0x1" edc:name="DPW3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW4" edc:desc="" edc:mask="0x1" edc:name="DPW4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW5" edc:desc="" edc:mask="0x1" edc:name="DPW5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW6" edc:desc="" edc:mask="0x1" edc:name="DPW6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW7" edc:desc="" edc:mask="0x1" edc:name="DPW7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW8" edc:desc="" edc:mask="0x1" edc:name="DPW8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW9" edc:desc="" edc:mask="0x1" edc:name="DPW9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPW10" edc:desc="" edc:mask="0x1" edc:name="DPW10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1DPH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1DPH" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPH" edc:desc="" edc:mask="0x7ff" edc:name="DPH" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DPH0" edc:desc="" edc:mask="0x1" edc:name="DPH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH1" edc:desc="" edc:mask="0x1" edc:name="DPH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH2" edc:desc="" edc:mask="0x1" edc:name="DPH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH3" edc:desc="" edc:mask="0x1" edc:name="DPH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH4" edc:desc="" edc:mask="0x1" edc:name="DPH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH5" edc:desc="" edc:mask="0x1" edc:name="DPH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH6" edc:desc="" edc:mask="0x1" edc:name="DPH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH7" edc:desc="" edc:mask="0x1" edc:name="DPH7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH8" edc:desc="" edc:mask="0x1" edc:name="DPH8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH9" edc:desc="" edc:mask="0x1" edc:name="DPH9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPH10" edc:desc="" edc:mask="0x1" edc:name="DPH10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1DPWT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1DPWT" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPWT" edc:desc="" edc:mask="0x7ff" edc:name="DPWT" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DPWT0" edc:desc="" edc:mask="0x1" edc:name="DPWT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT1" edc:desc="" edc:mask="0x1" edc:name="DPWT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT2" edc:desc="" edc:mask="0x1" edc:name="DPWT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT3" edc:desc="" edc:mask="0x1" edc:name="DPWT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT4" edc:desc="" edc:mask="0x1" edc:name="DPWT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT5" edc:desc="" edc:mask="0x1" edc:name="DPWT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT6" edc:desc="" edc:mask="0x1" edc:name="DPWT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT7" edc:desc="" edc:mask="0x1" edc:name="DPWT7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT8" edc:desc="" edc:mask="0x1" edc:name="DPWT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT9" edc:desc="" edc:mask="0x1" edc:name="DPWT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPWT10" edc:desc="" edc:mask="0x1" edc:name="DPWT10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1DPHT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1DPHT" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPHT" edc:desc="" edc:mask="0x7ff" edc:name="DPHT" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DPHT0" edc:desc="" edc:mask="0x1" edc:name="DPHT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT1" edc:desc="" edc:mask="0x1" edc:name="DPHT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT2" edc:desc="" edc:mask="0x1" edc:name="DPHT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT3" edc:desc="" edc:mask="0x1" edc:name="DPHT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT4" edc:desc="" edc:mask="0x1" edc:name="DPHT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT5" edc:desc="" edc:mask="0x1" edc:name="DPHT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT6" edc:desc="" edc:mask="0x1" edc:name="DPHT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT7" edc:desc="" edc:mask="0x1" edc:name="DPHT7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT8" edc:desc="" edc:mask="0x1" edc:name="DPHT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT9" edc:desc="" edc:mask="0x1" edc:name="DPHT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHT10" edc:desc="" edc:mask="0x1" edc:name="DPHT10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nnnnn--nnn" edc:cname="G1CON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00000--000" edc:name="G1CON2" edc:nzwidth="16" edc:por="0000--00000--000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPMODE" edc:desc="" edc:mask="0x7" edc:name="DPMODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DPBPP" edc:desc="" edc:mask="0x7" edc:name="DPBPP" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="DPTEST" edc:desc="" edc:mask="0x3" edc:name="DPTEST" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DPSTGER" edc:desc="" edc:mask="0x3" edc:name="DPSTGER" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DPGWDTH" edc:desc="" edc:mask="0x3" edc:name="DPGWDTH" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DPMODE0" edc:desc="" edc:mask="0x1" edc:name="DPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPMODE1" edc:desc="" edc:mask="0x1" edc:name="DPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPMODE2" edc:desc="" edc:mask="0x1" edc:name="DPMODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DPBPP0" edc:desc="" edc:mask="0x1" edc:name="DPBPP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPBPP1" edc:desc="" edc:mask="0x1" edc:name="DPBPP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPBPP2" edc:desc="" edc:mask="0x1" edc:name="DPBPP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPTEST0" edc:desc="" edc:mask="0x1" edc:name="DPTEST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPTEST1" edc:desc="" edc:mask="0x1" edc:name="DPTEST1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DPSTGER0" edc:desc="" edc:mask="0x1" edc:name="DPSTGER0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPSTGER1" edc:desc="" edc:mask="0x1" edc:name="DPSTGER1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPGWDTH0" edc:desc="" edc:mask="0x1" edc:name="DPGWDTH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPGWDTH1" edc:desc="" edc:mask="0x1" edc:name="DPGWDTH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="G1CON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="G1CON3" edc:nzwidth="16" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPHSOE" edc:desc="" edc:mask="0x1" edc:name="DPHSOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPVSOE" edc:desc="" edc:mask="0x1" edc:name="DPVSOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPENOE" edc:desc="" edc:mask="0x1" edc:name="DPENOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPPWROE" edc:desc="" edc:mask="0x1" edc:name="DPPWROE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPHSPOL" edc:desc="" edc:mask="0x1" edc:name="DPHSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPVSPOL" edc:desc="" edc:mask="0x1" edc:name="DPVSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPENPOL" edc:desc="" edc:mask="0x1" edc:name="DPENPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPCLKPOL" edc:desc="" edc:mask="0x1" edc:name="DPCLKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPPOWER" edc:desc="" edc:mask="0x1" edc:name="DPPOWER" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DPPINOE" edc:desc="" edc:mask="0x1" edc:name="DPPINOE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1ACTDA" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1ACTDA" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACTPIX" edc:desc="" edc:mask="0xff" edc:name="ACTPIX" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="ACTLINE" edc:desc="" edc:mask="0xff" edc:name="ACTLINE" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ACTPIX0" edc:desc="" edc:mask="0x1" edc:name="ACTPIX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX1" edc:desc="" edc:mask="0x1" edc:name="ACTPIX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX2" edc:desc="" edc:mask="0x1" edc:name="ACTPIX2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX3" edc:desc="" edc:mask="0x1" edc:name="ACTPIX3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX4" edc:desc="" edc:mask="0x1" edc:name="ACTPIX4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX5" edc:desc="" edc:mask="0x1" edc:name="ACTPIX5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX6" edc:desc="" edc:mask="0x1" edc:name="ACTPIX6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTPIX7" edc:desc="" edc:mask="0x1" edc:name="ACTPIX7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE0" edc:desc="" edc:mask="0x1" edc:name="ACTLINE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE1" edc:desc="" edc:mask="0x1" edc:name="ACTLINE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE2" edc:desc="" edc:mask="0x1" edc:name="ACTLINE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE3" edc:desc="" edc:mask="0x1" edc:name="ACTLINE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE4" edc:desc="" edc:mask="0x1" edc:name="ACTLINE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE5" edc:desc="" edc:mask="0x1" edc:name="ACTLINE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE6" edc:desc="" edc:mask="0x1" edc:name="ACTLINE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACTLINE7" edc:desc="" edc:mask="0x1" edc:name="ACTLINE7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
